""""
    2024年3月27日 17点39分
    author：liang
"""

# +运算符
# 输出后=后有个空格
print("12+13=", 12 + 13)
# 输出后代码后没有空格,使用f-string(适合python3.6版本及以上)
print(f"12+13={12+13}")

# -运算符
# =后有空格
print("15-2=", 15 - 2)
# =后没有空格,使用字符串格式化(format方法)
print("15-2={}".format(15-2))

# *运算符
print("3*5=", 3 * 5)
# 无空格输出,使用字符串拼接
print("3*5="+str(3 * 5))

# /运算符,输出的是浮点型
print("9/4=", 9 / 4)
# 无空格输出,使用%操作符进行字符串格式化
print("9/4=%.2f" % (9/4))

# //取整除运算符
print("9//4=", 9 // 4)
# 无空格输出,使用join方法和列表推导式
print(''.join(["9//4=", str(9 // 4)]))

# %取余运算符
print("4%3=", 4 % 3)

# **运算符
print("10**3=", 10 ** 3)